National_bank_xml/PRISTIGAO_RTGS.XML

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.com" xmlns:ns3="http://strukturaRtgsNaloga.com" xmlns:ns4="http://mt102.BankXml.bankXml.example.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>qCEObJYy8eaAkMhHrMgHo25810FejA4WJysAfJZ3F45XhMwMRI/m9wMeaWDrlvZg1gDjhhFbtK5U&#13;
GrEQ+bxqZN7OlswOfot7+Ems+n47lLzkDgs99rYLbHh80Rd0VlOEHfjJ6f174/3oadF04ENq+v63&#13;
SozXGXKnJRQ4gMAwwOA=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>FHjXUGboRxfVGL37tiXhHLVo3Fv+/NMQI3FFzmOFN61I4YSAS3JeEtaXvypoLa+MmIfYHh6ZHRRK&#13;
mskLCXdbPiAvpR1Vi9IfUEge4h/In5mB8on/6KY1GxaN79P3aALLK3h0iJ0RPHdg8Qq/y7Jm3VDr&#13;
0Zq8IlWKTyXTADoSMLm3jBOlgOUS+3cAeV38ZzIbv20DDk8cB5PyERyTrTNouOm4keirpl0/pHE1&#13;
17BiH3R1kxB2MX9sULmUNULsGvDTasi+6e/UvDFzIjifqnxuqNQZ453/AFIzxSSvaprrs2fLcwzP&#13;
RVvJoOK3wcP02ia/m0lK6QaHgj99oUR3AbZjccVwfcuh4FZqKmKkMjVzh+tW3Jk1Gh0AQBT5zrnY&#13;
VMGvnfntKcIkqw6u96Aoyov3B9rZav2jkaMvvpxIgKsKJwu9122burTvR8MX/w2TjbQbAiCKXqJU&#13;
TmJ2c2wyMpvZ/JEh3R7OmVmoX5ee4iCyCVjwqfV6bHt00ZdPjK9+vD1oXBvzqbrFr7+X9lJy5a/X&#13;
SndTQU014z0cYQJV9aegSHJh9MdN6Tq1zCOblDlUGOXFJYl1WUI3rBQSzn0FEXxLnXTi/tyFZQyT&#13;
MBs6eob126rAd4jEA+Corvdr9dyfvED+YHtpkSEfvg1emRGGBjuphgry5vSlUtw2ITsanpBzEV9V&#13;
z5LQe91y30G2VR3Pww+RMpgwHEhtPJbDyTn/M5G2CPqwwbxrY9RJ8bVVfmxEmH6bN9pEjDdetgyV&#13;
vqyoxpO782TTp+YJkGSmKs0ddnQpvrG00+c3e8SkcIRpNNnLauJpmv0IM+a5ChnIbg2IY+/Obvza&#13;
/TQMnv52qSOA9NidLQi7Gwywd1Y+QkvEFV0/Lvzb/GS93993b7QogHU/FxSiMJMxc74OralLh8m+&#13;
icu4Zu8dtRbE2OeDAWpb0+MZdTDziqnHxKcQyJuh8U5OEM9UiqNYKEqaz3AwQSQbNAn3qbVG1k+a&#13;
XjtcB7yEuI4SIwd3J1U5pQLXsczQ1c5nc7SxdlibUAGo4XCSVJKWDNS/f47qmnpJ1UuJ6h+HpdK7&#13;
gSNrQMWdluUmyEXTEs+Kg5pCN62EGZYpfKQj+OHDPfhNi6u7Brqv1RA3uWywhrfzVejve94DtqRw&#13;
3LixNY1pZg4T7P3WsgmLt4o9SXsEGVcZ1KELMvXObSzMz1naIoDbUuAZ4XhNl0wUhFMJ+GUpYntd&#13;
zhCJu3Dmv/dckjGeesEBejZ1Fg8ORuz9ZWSh1RoMphDU6LamTNvIpD89JuHhdOsqOa/qXUeved9O&#13;
QKWObDWv2q35txo060YnCdZXXcuFzw2Ur32goCqKArmTxT1eEPrFR/2GTTqRiOOasnSV+bfh1A==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>p4Ifg+QRflbGUT82EQNxv/mCyQQ=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
lj8gPaSAS4nnzUJMro4nW6lMMb3TnhhGbfxsqBn43mB5t27phWL3L4z/PLCxjut8NMR/xgPYR21P&#13;
kn2+iAZ9YqVlFUMB8hXxWKIYVO1OVJ354QxNzq2wW0eUSnR6Qfb3dnuwbqxw/PhfQvFpH7ZEV81/&#13;
021gjh9EBWlhiU2SxQI=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>